       IDENTIFICATION DIVISION.
       PROGRAM-ID. MainPgm.
       Procedure Division.
           Display 'In Main program'.
           Display 'Calling sub1'.
           Call 'sub1'.
           Display 'End of Main program'.
