       IDENTIFICATION DIVISION.
       PROGRAM-ID. sub1.
       Procedure Division.
           Display 'In Sub1'.
           Goback.
       END PROGRAM sub1.
