       Identification Division.
       Program-id. TSTemplt.  *> change this if you'd like
      
       Data Division.
       Working-Storage Section.
      ****************************************************************
      * Define any data needed by the program you are testing
      * that will be sent as parameters here
      ****************************************************************
   
      ****************************************************************
      * Copybook with Fields required/used by Test Suite Template
      * Fields will be set by GUnit and used however the programmer
      * deems necessary for thier test processing 
      *
      * DON'T TOUCH THIS!
      ****************************************************************  
         copy '../copybooks/TSFields.cpy'.
      ****************************************************************
      * Copybook with Fields required/used by GUnit
      * Fields will be set by the caller and returned by GUnit 
      *
      * DON'T TOUCH THIS!
      ****************************************************************
       copy '../copybooks/GUnitFld.cpy'.    
       
       Procedure Division.

           Perform Run-Tests.       *> Perform all tests in test suite
           Perform TS-Show-Results. *> Display results of all tests

           Goback.
       
       Run-Tests. *> Perform each test paragraph here

           Perform Test-1.

       Run-Tests-Exit.
           exit.


       Test-1. *> Each test should be placed in their own paragraph

      * Arrange - Setup data for test
      * Initialize GUnit-Test-Fields default values.
           perform GU-Initialize-Default-Values.

      * Set up GUnit-Test-Fields for test
           move "Decription of Test" *> Set Test Desc.
             to TS-Test-Description.

      * Set up parameters/Values need to be sent to program being tested
           move "Something" to WS-Parameter-To-Send
           Move 'Error Message' to GU-Error-Msg. *> Set err msg
       
      * Act - Perform process to obtain actual value     
           call 'TheProgram' using WhatEver-it-Needs
                                 , WS-Group-Item-To-Hold-Result.

      * Move the actual result to be tested to associated GUnit field
           move WS-the-Result  to GU-Actual-Value-Numeric.

      * Call GUnit and save result.     
      * Choose the one you want executed

      *    Perform GU-Assert-Numeric-Equal.
      *    Perform GU-Assert-Numeric-Not-Equal.
      *    Perform GU-Assert-String-Equal.
      *    Perform GU-Assert-String-Not-Equal.

       Test-1-Exit.
           Exit.

      ******************************************************************
      * COPY Test Suite Features Desired/Used before end of program
      * DON'T TOUCH THIS!
      ******************************************************************
       copy '../copybooks/TSGUAEQN.cpy'. *> Assert Equals Numeric
       copy '../copybooks/TSGUANEN.cpy'. *> Assert NotEquals Numeric
       copy '../copybooks/TSGUAEQS.cpy'. *> Assert Equals String
       copy '../copybooks/TSGUANES.cpy'. *> Assert NotEquals String
       copy '../copybooks/TSShow.cpy'.   *> Test Suit Display Results
       copy '../copybooks/GUInit.cpy'.   *> GUnit Initialize to Defaults

       end program TSTemplt.  *> Name must match Program-Id.

      ******************************************************************
      * COPY program code to be tested AFTER end of Test Suite Program
      * DON'T TOUCH THIS!
      ******************************************************************
       copy './appCalc.cbl'.             *> Program to be tested

      ******************************************************************
      * COPY program code to be tested AFTER end of Test Suite Program
      * DON'T TOUCH THIS!
      ******************************************************************       
       copy '../copybooks/GUnitV3.cbl'.   *> GUnit Code
