       01  DODUD.
           05  COLLECTIE-NAME PIC X(64) VALUE 'PENDING'.
           05  SPECIES PIC X(64) VALUE 'Dodud'.
           05  COLLECTIE-TYPE PIC X(64) VALUE 'SPECIAL'.
           05  SOUND PIC X(64) VAlUE 'dooooo-up'.
           05  PREFERRED-BIOME PIC X(64) VALUE 'PLAINS'.
           05  GRAPHIC PIC X(1024) VALUE 
               '\|/          (__)' & X'0A' & 
               '     `\------(oo)' & X'0A' &
               '       ||    (__)' & X'0A' &
               '       ||w--||     \|/' & X'0A' &
               '   \|/'.
       
