       01  COLLECTIES-TABLE.
           05 COLLECTIE OCCURS 100 TIMES.
               10  COLLECTIE-ID PIC 999.
               10  COLLECTIE-NAME PIC X(64).
               10  SPECIES PIC X(64).
               10  COLLECTIE-TYPE PIC X(64).
               10  SOUND PIC X(64).
               10  PREFERRED-BIOME PIC X(64).
               10  ATTACK-POWER PIC 999.
               10  DEFEND-FLOOR PIC 999.
               10  GRAPHIC PIC X(1024).
               