       01  COLLECTIES-TABLE.
           05 COLLECTIE OCCURS 10 TIMES.
               10  COLLECTIE-NAME PIC X(64).
               10  SPECIES PIC X(64).
               10  COLLECTIE-TYPE PIC X(64).
               10  SOUND PIC X(64).
               10  PREFERRED-BIOME PIC X(64).
               10  GRAPHIC PIC X(1024).
               