       01  collectie.
           05  collectie-name PIC X(64).
           05  species PIC X(64).
           05  collectie-type PIC X(64).
           05  sound PIC X(64).
           05  preferred-biome PIC X(64).
           05  graphic PIC X(1024).
           
       
       